In [1]:
import numpy as np

In [2]:
import pandas as pd

missing data

In [4]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan], 'd':[3,4,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]}

In [5]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [7]:
#converting dictionary into dataframe
#note list having np.nan values is converted into the float values
df=pd.DataFrame(d)
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [8]:
df.dropna(axis=0)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [9]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [10]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [11]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [12]:
#here thresh will provide the tables with atleast 3 values are known
df.dropna(thresh=3)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN

In [13]:
df.dropna(thresh=4)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN

In [14]:
#here we are filling all the missing data i.e np.nan by 1
df.fillna(1)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [15]:
df['b'].fillna(value=1)

0    6.0
1    7.0
2    8.0
3    9.0
4    1.0
Name: b, dtype: float64

In [18]:
#filling the value by the mean/avg
df['d'].fillna(value=df['d'].mean())

0    3.0
1    4.0
2    3.5
3    3.5
4    3.5
Name: d, dtype: float64

In [19]:
df['d'].fillna(value=df['c'].mean())

0    3.0
1    4.0
2    1.0
3    1.0
4    1.0
Name: d, dtype: float64

Analysing data using groupby

In [20]:
p={'item':['apple','apple','orange','orange','guns','guns'],'days':['mon','tues','wed','thur','fri','sat'],'sales':[100,80,200,100,5,10]}

In [21]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tues', 'wed', 'thur', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [23]:
df=pd.DataFrame(p)

In [24]:
df

     item  days  sales
0   apple   mon    100
1   apple  tues     80
2  orange   wed    200
3  orange  thur    100
4    guns   fri      5
5    guns   sat     10

In [25]:
#grouping the item but it is not any number so it will not return any number back
x=df.groupby('item')

In [26]:
x

In [27]:
#it will find the mean of both apple ,orange and guns 
x.mean()

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [28]:
#for sum
x.sum()

        sales
item
apple     180
guns       15
orange    300

In [29]:
#for standard deviation
x.std()

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [30]:
#to count 
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [31]:
#maximum sale count
#note days is not correctly showing here
x.max()

        days  sales
item
apple   tues    100
guns     sat     10
orange   wed    200

In [32]:
x.min()

        days  sales
item
apple    mon     80
guns     fri      5
orange  thur    100

In [33]:
#to describe the table
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [34]:
#to make above table in vertical  form
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000